/*
 * phys_drive.h
 *
 *  Created on: Feb 15, 2022
 *      Author: tamacake39
 */

#ifndef INC_PHYS_DRIVE_H_
#define INC_PHYS_DRIVE_H_

/*============================================================
 各種定数・変数宣言
 ============================================================*/

//====変数====
#ifdef MAIN_C_ // main.cからこのファイルが呼ばれている場合
/*グローバル変数の定義*/

#else // main.c以外からこのファイルが呼ばれている場合
/*グローバル変数の宣言*/

#endif

/*============================================================
 関数プロトタイプ宣言
 ============================================================*/

//====走行系====
//----基幹関数----

//----上位関数----

#endif /* INC_PHYS_DRIVE_H_ */
